app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.all
---
SELECT "wishes".* FROM "wishes"

  def show
    @wish = Wish.find(params[:id])
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @wish = Wish.find(params[:id])
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @wish = Wish.new(params[:wish])

    respond_to do |format|
      if @wish.save
---
INSERT INTO "wishes" ("created_at", "deal", "description", "threshold", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @wish = Wish.find(params[:id])

    respond_to do |format|
      if @wish.update_attributes(params[:wish])
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "wishes" SET "deal" = 'Buy one get one free dumplings!!', "updated_at" = '2012-04-07 06:13:56.336292' WHERE "wishes"."id" = 2